# Web Scraping

In [1]:
import pandas as pd
import logging

logging.basicConfig(level=logging.INFO)

In [2]:
url = 'https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes'

In [3]:
def scrape(url):
  logging.info(f"Scraping website with url: '{url}' ...")
  return pd.read_html(url, header=None)

In [4]:
dfs = scrape(url)[1]

INFO:root:Scraping website with url: 'https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes' ...

In [5]:
dfs

   No.                        Nama  ...       Kebangsaan      Sumber kekayaan
0  NaN                  Jeff Bezos  ...  Amerika Serikat               Amazon
1  NaN                   Elon Musk  ...  Amerika Serikat        Tesla, SpaceX
2  NaN  Bernard Arnault & keluarga  ...          Prancis                 LVMH
3  NaN                  Bill Gates  ...  Amerika Serikat            Microsoft
4  NaN             Mark Zuckerberg  ...  Amerika Serikat       Meta Platforms
5  NaN              Warren Buffett  ...  Amerika Serikat   Berkshire Hathaway
6  NaN               Larry Ellison  ...  Amerika Serikat   Oracle Corporation
7  NaN                  Larry Page  ...  Amerika Serikat        Alphabet Inc.
8  NaN                 Sergey Brin  ...  Amerika Serikat        Alphabet Inc.
9  NaN               Mukesh Ambani  ...            India  Reliance Industries

[10 rows x 6 columns]

# Cleaning Data

In [6]:
import re

In [7]:
def is_money_miliar(string_money):
  return string_money.lower().endswith('miliar')

In [31]:
def transform_money_format(string_money):
  half_clean_string = string_money.lower().replace('$','').replace(',','.').replace(' ','')
  return re.sub(r"[?\[M\]miliar|\[J\]juta]", "", half_clean_string)

In [35]:
def transform(df, tahun):
  logging.info('Transforming DataFrame ...')

  columns_mapping = {
      'Nama' : 'nama', 
      'No.' : 'nomor_urut',
      'Kekayaan bersih (USD)' : 'kekayaan_bersih_usd',
      'Usia' : 'usia',
      'Kebangsaan' : 'kebangsaan',
      'Sumber kekayaan' : 'sumber_kekayaan',
  }

  renamed_df = df.rename(columns = columns_mapping)

  renamed_df['tahun'] = tahun

  renamed_df['kekayaan_bersih_usd_juta'] = renamed_df['kekayaan_bersih_usd'].apply(
      lambda value : float(transform_money_format(value)) * 1000 if is_money_miliar(value) else  float(transform_money_format(value))  
  )

  return renamed_df[['nama','nomor_urut','kekayaan_bersih_usd_juta','usia','kebangsaan','sumber_kekayaan']]

In [36]:
df_2021 = transform(dfs,2021)

INFO:root:Transforming DataFrame ...

In [37]:
  df_2021

                         nama  nomor_urut  ...       kebangsaan      sumber_kekayaan
0                  Jeff Bezos         NaN  ...  Amerika Serikat               Amazon
1                   Elon Musk         NaN  ...  Amerika Serikat        Tesla, SpaceX
2  Bernard Arnault & keluarga         NaN  ...          Prancis                 LVMH
3                  Bill Gates         NaN  ...  Amerika Serikat            Microsoft
4             Mark Zuckerberg         NaN  ...  Amerika Serikat       Meta Platforms
5              Warren Buffett         NaN  ...  Amerika Serikat   Berkshire Hathaway
6               Larry Ellison         NaN  ...  Amerika Serikat   Oracle Corporation
7                  Larry Page         NaN  ...  Amerika Serikat        Alphabet Inc.
8                 Sergey Brin         NaN  ...  Amerika Serikat        Alphabet Inc.
9               Mukesh Ambani         NaN  ...            India  Reliance Industries

[10 rows x 6 columns]

# Storing Data to Database

In [38]:
pip install psycopg2-binary==2.8.6

Collecting psycopg2-binary==2.8.6
  Downloading psycopg2_binary-2.8.6-cp37-cp37m-manylinux1_x86_64.whl (3.0 MB)
     |████████████████████████████████| 3.0 MB 4.2 MB/s
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.8.6

In [39]:
from sqlalchemy import create_engine

In [40]:
DB_NAME = 'postgres'
DB_USER = 'user1'
DB_PASSWORD = 'user1'
DB_HOST = '104.197.148.144'
DB_PORT = '5432'
CONNECTION_STRING = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
TABLE_NAME = 'Fakhita-peserta_orang_terkaya_forbes'

In [41]:
CONNECTION_STRING

'postgresql://user1:user1@104.197.148.144:5432/postgres'

In [42]:
def write_to_postgres(df, db_name, table_name, connection_string):
  engine = create_engine(connection_string)
  logging.info(f"write dataframe to database : '{db_name}', table : '{table_name}' ...")
  df.to_sql(name = table_name, con=engine, if_exists='replace', index=False)

In [43]:
write_to_postgres(df=df_2021, db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

INFO:root:write dataframe to database : 'postgres', table : 'Fakhita-peserta_orang_terkaya_forbes' ...

# Read Data from Database

In [44]:
def read_from_postgres(db_name, table_name, connection_string):
  engine = create_engine(connection_string)

  logging.info(f"Reading postgres database : '{db_name}', table : '{table_name}'...")
  return pd.read_sql_table(table_name, con=engine)

In [45]:
result_df = read_from_postgres(db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

INFO:root:Reading postgres database : 'postgres', table : 'Fakhita-peserta_orang_terkaya_forbes'...

In [46]:
print('Daftar Orang Terkaya di Indonesia : ')
print(result_df.to_string())

Daftar Orang Terkaya di Indonesia :
                         nama  nomor_urut  kekayaan_bersih_usd_juta  usia       kebangsaan      sumber_kekayaan
0                  Jeff Bezos         NaN                  177000.0    57  Amerika Serikat               Amazon
1                   Elon Musk         NaN                  151000.0    49  Amerika Serikat        Tesla, SpaceX
2  Bernard Arnault & keluarga         NaN                  150000.0    72          Prancis                 LVMH
3                  Bill Gates         NaN                  124000.0    65  Amerika Serikat            Microsoft
4             Mark Zuckerberg         NaN                   97000.0    36  Amerika Serikat       Meta Platforms
5              Warren Buffett         NaN                   96000.0    90  Amerika Serikat   Berkshire Hathaway
6               Larry Ellison         NaN                   93000.0    76  Amerika Serikat   Oracle Corporation
7                  Larry Page         NaN                   91500.0    48  Amerika Serikat        Alphabet Inc.
8                 Sergey Brin         NaN                   89000.0    47  Amerika Serikat        Alphabet Inc.
9               Mukesh Ambani         NaN                   84500.0    63            India  Reliance Industries